ErikHurum/S2Prog/IO/ANZB_ATmega1281/Src/UsartPro.c
/****************************************************************************************
/ Com protocol for USART0&1
/
***************************************************************************************/

#ifdef __ATMEGA_1280__
    #include	"iom1280.h"
#endif

#ifdef __ATMEGA_1281__
    #include "iom1281.h"
#endif
#include "stdio.h"
#include "math.h"
#include "string.h"
#include "externals.h"
#include "version.h"
__no_init int RestartCnt             @0x21FD;
__no_init char BootloaderRevision    @0x21FF;


/*************************************************************************
*   (This is a timer calback)
*  Timout timer USART 0
*
*************************************************************************/
void TimoutUSART0(void) {

    UCSR0B &= ~(__BIT_MASK(UDRIE0));            // transmission end, disable int.
    ClrBit(PORTE, 0x04);                              // TXE0 off
#if USE_1281_RX_INT_TASK == 0
    OS_StopTimer(&TimerUSART0);                    // and stop timer
#endif
    GoToSyncUART(0);                                    // go to sync modus for recive
}

/*************************************************************************
*   (This is a timer calback)
*  Timer USART 0 on before TX
*
*************************************************************************/
void TimoutUSART0On(void) {

    UCSR0B |= __BIT_MASK(UDRIE0);                     // start sending by enableing interrupt
#if USE_1281_RX_INT_TASK == 0
    OS_StopTimer(&TimerUSART0On);                    // and stop timer
#endif
}

/*************************************************************************
*   (This is a timer calback)
*  Timout timer USART 1
*
*************************************************************************/
void TimoutUSART1(void) {

    UCSR1B &= ~(__BIT_MASK(UDRIE1));            // transmission end, disable int.
    ClrBit(PORTE, 0x08);                              // TXE1 off
#if USE_1281_RX_INT_TASK == 0
    OS_StopTimer(&TimerUSART1);                    // and stop timer
#endif
    GoToSyncUART(1);                                    // go to sync modus for recive
}


/*************************************************************************
*   (This is a timer calback)
*  Timer USART 1 on before TX
*
*************************************************************************/
void TimoutUSART1On(void) {

    UCSR1B |= __BIT_MASK(UDRIE1);                     // start sending by enableing interrupt
#if USE_1281_RX_INT_TASK == 0
    OS_StopTimer(&TimerUSART1On);                    // and stop timer
#endif
}


#if USE_1281_RX_INT_TASK==0
/*************************************************************************
*   (This is a task)
*  Usart0 handler
*
*************************************************************************/
void Usart0Handler(void) {

    while (1) {
        OS_WaitEvent(1);
        OS_Use(&UARTSEND);
        UsartCheckPackage(0);
        OS_Unuse(&UARTSEND);
    }
}

/*************************************************************************
*   (This is a task)
*  Usart1 handler
*
*************************************************************************/
void Usart1Handler(void) {

    while (1) {
        OS_WaitEvent(1);
        OS_Use(&UARTSEND);
        UsartCheckPackage(1);
        OS_Unuse(&UARTSEND);
    }
}
#endif
/*************************************************************************
*
*  Check the incoming packages
*
*************************************************************************/
void UsartCheckPackage(char ch) {

    unsigned short pointer;
    char    retval;

    UART[ch].RxSendReply = false;                              // flag for answering set to fault
    UART[ch].TxFirst = 11;                                     // Start pos for first TX command
    pointer = 7;
    do {
        retval = CheckActionUart(ch, pointer);
        pointer = pointer + UART[ch].pRxBuffer[pointer + 2]
            + (UART[ch].pRxBuffer[pointer + 3] * 256) + 4;      // Point to a command cmd hb/lb
    } while (retval && (pointer < (UART[ch].RxPacklen - 4)));
    if (UART[ch].RxSendReply) {                                   //send answer?
        Uart_BuildTail(ch);                                       // yes, build tail (and header) and start sending
    } else {
        GoToSyncUART(ch);                                        // go to sync modus here if not reply
    }
}


/*************************************************************************
*
*  Check action on received data
*
*************************************************************************/
char CheckActionUart(char ch, unsigned short pointer) {

    unsigned short   command;
    char    retval = true;

    command = UART[ch].pRxBuffer[pointer] | (UART[ch].pRxBuffer[pointer + 1] << 8);
    switch (command) {                                  // check action
    case CMD_REQ_STATUS :                           // Regusest status for target
        BuildStatusData(ch);                         // make package
        break;

    case CMD_GET_STACKSTATUS :                        // Request stck status
        BuildStackStatus(ch, pointer + 4);                     // receive package
        break;

    case CMD_EEPROM_RESET :                        // Reset EEPROM??
        GetResetEEPROM(ch, pointer + 4);                     // receive package
        break;

    case CMD_GOTO_BOOTLOADER :                        // Goto bootlaoder??
        GetGotoBootloader(ch, pointer + 4);                     // receive package
        break;

    case CMD_SND_EEPROM_DATA :                              // Receive EEPROM data
        GetEEPROMData(ch, pointer + 4);                     // receive package
        break;

    case CMD_REQ_EEPROM_DATA :                              // Request to send EEPROM data
        BuildEEPROMData(ch, pointer + 4);                     // receive package
        break;

    case CMD_REQ_INT_DATA :                              // Request external data
        BuildADInt(ch, pointer + 4);                     // receive package
        break;

