ErikHurum/S2Prog/IO/ANZB_ATmega1281/Src/UsartPro.c
    RestartStatus = 0;                                                       // set reset stat to 0 = read
}

/*************************************************************************
*
* Build EEPROM data package
*
*************************************************************************/
void BuildEEPROMData(char ch, short pointer) {

    short ntna;
    char channel;
    UART[ch].RxSendReply = true;                               // flag for answering

    UART[ch].pTxBuffer[UART[ch].TxFirst++] = CMD_REP_EEPROM_DATA & 0xff;
    UART[ch].pTxBuffer[UART[ch].TxFirst++] = CMD_REP_EEPROM_DATA >> 8;
    ntna = UART[ch].TxFirst;                                    /* remember index */
    UART[ch].TxFirst += 2;                                      // two byte length

    channel = UART[ch].pRxBuffer[pointer];
    UART[ch].pTxBuffer[UART[ch].TxFirst++] = channel; //channel

    ReadEEPROMBuffer((channel * sizeof(float) * 2), sizeof(float), (char *)&UART[ch].pTxBuffer[UART[ch].TxFirst]);
    UART[ch].TxFirst += sizeof(float);
    ReadEEPROMBuffer((channel * sizeof(float) * 2) + sizeof(float), sizeof(float), (char *)&UART[ch].pTxBuffer[UART[ch].TxFirst]);
    UART[ch].TxFirst += sizeof(float);

    UART[ch].pTxBuffer[ntna] = (UART[ch].TxFirst - ntna - 2) & 0xff;      // length of data block lb
    UART[ch].pTxBuffer[ntna + 1] = ((UART[ch].TxFirst - ntna - 2) >> 8) & 0xff; // length of data block hb
}


/*************************************************************************
*
* Build datablock for Internal AD
*
*************************************************************************/
void BuildADInt(char ch, short pointer) {

    short ntna, i;
    UART[ch].RxSendReply = true;                               // flag for answering

    UART[ch].pTxBuffer[UART[ch].TxFirst++] = CMD_REP_INT_DATA & 0xff;
    UART[ch].pTxBuffer[UART[ch].TxFirst++] = CMD_REP_INT_DATA >> 8;
    ntna = UART[ch].TxFirst;                                    /* remember index */
    UART[ch].TxFirst += 2;                                      // two byte length

    for (i = 0; i < 3; i++) {
        UART[ch].pTxBuffer[UART[ch].TxFirst++] = ADInt.Result[i];
        UART[ch].pTxBuffer[UART[ch].TxFirst++] = ADInt.Result[i] >> 8;   // ADresult
    }

    UART[ch].pTxBuffer[ntna] = (UART[ch].TxFirst - ntna - 2) & 0xff;      // length of data block lb
    UART[ch].pTxBuffer[ntna + 1] = ((UART[ch].TxFirst - ntna - 2) >> 8) & 0xff; // length of data block hb

}


/*************************************************************************
*
* Build datablock for eeprom on ADcard
*
*************************************************************************/
void BuildADEpromdata(char ch, char portch) {

    UART[ch].RxSendReply = true;                               // flag for answering

    UART[ch].pTxBuffer[UART[ch].TxFirst++] = CMD_REP_RS4_ADBUF & 0xff;
    UART[ch].pTxBuffer[UART[ch].TxFirst++] = CMD_REP_RS4_ADBUF >> 8;
    short ntna = UART[ch].TxFirst;                                    // remember index
    UART[ch].TxFirst += 2;                                      // two byte length

    for (short i = 0; i < 44; i++) {
        UART[ch].pTxBuffer[UART[ch].TxFirst++] = TData.RS4.FromTargetBuffer[portch][i];
    }
    UART[ch].pTxBuffer[ntna] = (UART[ch].TxFirst - ntna - 2) & 0xff;      // length of data block lb
    UART[ch].pTxBuffer[ntna + 1] = ((UART[ch].TxFirst - ntna - 2) >> 8) & 0xff; // length of data block hb

}

/*************************************************************************
*
* Build datablock for WHData on ADcard
*
*************************************************************************/
void BuildWHdata(char ch, short pointer) {

    UART[ch].RxSendReply = true;                               // flag for answering

    UART[ch].pTxBuffer[UART[ch].TxFirst++] = CMD_SND_RS4_WHBUF & 0xff;
    UART[ch].pTxBuffer[UART[ch].TxFirst++] = CMD_SND_RS4_WHBUF >> 8;
    short ntna = UART[ch].TxFirst;                          // remember index
    UART[ch].TxFirst += 2;                                  // two byte length

    OS_EnterRegion();
    for (short i = 0; i < 4; i++) {
        UART[ch].pTxBuffer[UART[ch].TxFirst++] = TData.RS4.WTrackCnt[UART[ch].pRxBuffer[pointer]][i] & 0xff; // WashTrackcnt
        UART[ch].pTxBuffer[UART[ch].TxFirst++] = (TData.RS4.WTrackCnt[UART[ch].pRxBuffer[pointer]][i] >> 8) & 0xff; // WashTrackcnt
    }
    UART[ch].pTxBuffer[UART[ch].TxFirst++] =  TData.RS4.LevelSwitch[UART[ch].pRxBuffer[pointer]];
    UART[ch].pTxBuffer[UART[ch].TxFirst++] =  TData.RS4.WTTime[UART[ch].pRxBuffer[pointer]] & 0xff; // WashTrackcnt
    UART[ch].pTxBuffer[UART[ch].TxFirst++] = (TData.RS4.WTTime[UART[ch].pRxBuffer[pointer]] >> 8) & 0xff; // WashTrackcnt
    UART[ch].pTxBuffer[ntna] = (UART[ch].TxFirst - ntna - 2) & 0xff;      // length of data block lb
    UART[ch].pTxBuffer[ntna + 1] = ((UART[ch].TxFirst - ntna - 2) >> 8) & 0xff; // length of data block hb
    OS_LeaveRegion();
}



/*************************************************************************
*
* Build setup dat package for AN-ZB485
*
*************************************************************************/
void BuildRS4Setup(char ch, short pointer) {

    short ntna;
    UART[ch].RxSendReply = true;                               // flag for answering

    UART[ch].pTxBuffer[UART[ch].TxFirst++] = CMD_REP_RS4_SETUP & 0xff;
    UART[ch].pTxBuffer[UART[ch].TxFirst++] = CMD_REP_RS4_SETUP >> 8;
    ntna = UART[ch].TxFirst;                                    /* remember index */
    UART[ch].TxFirst += 2;                                      // two byte length

    UART[ch].pTxBuffer[UART[ch].TxFirst++] = TData.RS4.PortUsed;  // send the setup
    UART[ch].pTxBuffer[UART[ch].TxFirst++] = TData.RS4.SensorType[0];  // send the sensor type
    UART[ch].pTxBuffer[UART[ch].TxFirst++] = TData.RS4.SensorType[1];  // send the sensor type

    UART[ch].pTxBuffer[ntna] = (UART[ch].TxFirst - ntna - 2) & 0xff;      // length of data block lb
    UART[ch].pTxBuffer[ntna + 1] = ((UART[ch].TxFirst - ntna - 2) >> 8) & 0xff; // length of data block hb
}

/*************************************************************************
*
* Build datablock of measured data for ADcard
*
*************************************************************************/
void BuildMData485(char ch, short pointer) {
    short ntna, i;
    UART[ch].RxSendReply = true;                               // flag for answering

