ErikHurum/S2Prog/IO/ANZB_ATmega1281/Src/UsartPro.c
    UART[ch].pTxBuffer[UART[ch].TxFirst++] = CMD_REP_RS4_MDATA & 0xff;
    UART[ch].pTxBuffer[UART[ch].TxFirst++] = CMD_REP_RS4_MDATA >> 8;
    ntna = UART[ch].TxFirst;                                    /* remember index */
    UART[ch].TxFirst += 2;                                      // two byte length

    UART[ch].pTxBuffer[UART[ch].TxFirst++] = UART[ch].pRxBuffer[pointer];
    UART[ch].pTxBuffer[UART[ch].TxFirst++] = TData.RS4.IOUnitStatus[UART[ch].pRxBuffer[pointer]] | (RestartStatus << 4); // IOUnit status +  restart status
    UART[ch].pTxBuffer[UART[ch].TxFirst++] = TData.RS4.FailCnt[UART[ch].pRxBuffer[pointer]][0] & 0xff; // Failcnt error
    UART[ch].pTxBuffer[UART[ch].TxFirst++] = (TData.RS4.FailCnt[UART[ch].pRxBuffer[pointer]][0] >> 8) & 0xff; // Failcnt error
    UART[ch].pTxBuffer[UART[ch].TxFirst++] = TData.RS4.FailCnt[UART[ch].pRxBuffer[pointer]][1] & 0xff; // Failcnt total
    UART[ch].pTxBuffer[UART[ch].TxFirst++] = (TData.RS4.FailCnt[UART[ch].pRxBuffer[pointer]][1] >> 8) & 0xff; // Failcnt total
    UART[ch].pTxBuffer[UART[ch].TxFirst++] = TData.RS4.TargetStatusSWVer[UART[ch].pRxBuffer[pointer]]; // Target status byte 1
    UART[ch].pTxBuffer[UART[ch].TxFirst++] = TData.RS4.TargetStatusAddress[UART[ch].pRxBuffer[pointer]]; // Target status byte 2

    TData.RS4.TargetStatusAddress[UART[ch].pRxBuffer[pointer]] &= ~0x80;                                  //reset restart flag for adcard

    for (i = 0; i < 14; i++) {
        UART[ch].pTxBuffer[UART[ch].TxFirst++] = TData.RS4.TargetSetup1[UART[ch].pRxBuffer[pointer]][i];
        UART[ch].pTxBuffer[UART[ch].TxFirst++] = TData.RS4.TargetSetup2[UART[ch].pRxBuffer[pointer]][i];
        *((float *)&UART[ch].pTxBuffer[UART[ch].TxFirst]) = *((float *)&TData.RS4.Result[UART[ch].pRxBuffer[pointer]][i]);   // ADresult
        UART[ch].TxFirst += sizeof(float);
    }

    UART[ch].pTxBuffer[ntna] = (UART[ch].TxFirst - ntna - 2) & 0xff;      // length of data block lb
    UART[ch].pTxBuffer[ntna + 1] = ((UART[ch].TxFirst - ntna - 2) >> 8) & 0xff; // length of data block hb

}

/*************************************************************************
*
* Build datablock of raw and cal data for ADcard
*
*************************************************************************/
void BuildRData485(char ch, short pointer) {
    short ntna, i;
    UART[ch].RxSendReply = true;                               // flag for answering

    UART[ch].pTxBuffer[UART[ch].TxFirst++] = CMD_REP_RS4_RDATA & 0xff;
    UART[ch].pTxBuffer[UART[ch].TxFirst++] = CMD_REP_RS4_RDATA >> 8;
    ntna = UART[ch].TxFirst;                                    /* remember index */
    UART[ch].TxFirst += 2;                                      // two byte length

    UART[ch].pTxBuffer[UART[ch].TxFirst++] = UART[ch].pRxBuffer[pointer];
    for (i = 0; i < 14; i++) {
        *((short *)&UART[ch].pTxBuffer[UART[ch].TxFirst]) = *((short *)&TData.RS4.Raw[UART[ch].pRxBuffer[pointer]][i]);   // Raw data
        UART[ch].TxFirst += sizeof(short);
        *((short *)&UART[ch].pTxBuffer[UART[ch].TxFirst]) = *((short *)&TData.RS4.Cal[UART[ch].pRxBuffer[pointer]][i]);   // Cal data
        UART[ch].TxFirst += sizeof(short);
    }

    UART[ch].pTxBuffer[ntna] = (UART[ch].TxFirst - ntna - 2) & 0xff;      // length of data block lb
    UART[ch].pTxBuffer[ntna + 1] = ((UART[ch].TxFirst - ntna - 2) >> 8) & 0xff; // length of data block hb

}

/*************************************************************************
*
* Build setup data package for AN-ZBANA
*
*************************************************************************/
void BuildANASetup(char ch, short pointer) {

    short ntna;
    UART[ch].RxSendReply = true;                               // flag for answering

    UART[ch].pTxBuffer[UART[ch].TxFirst++] = CMD_REP_ANA_SETUP & 0xff;
    UART[ch].pTxBuffer[UART[ch].TxFirst++] = CMD_REP_ANA_SETUP >> 8;
    ntna = UART[ch].TxFirst;                                    /* remember index */
    UART[ch].TxFirst += 2;                                      // two byte length

    UART[ch].pTxBuffer[UART[ch].TxFirst++] = TData.Ana.PortUsed & 0xff;
    UART[ch].pTxBuffer[UART[ch].TxFirst++] = (TData.Ana.PortUsed >> 8) & 0xff;

    UART[ch].pTxBuffer[ntna] = (UART[ch].TxFirst - ntna - 2) & 0xff;      // length of data block lb
    UART[ch].pTxBuffer[ntna + 1] = ((UART[ch].TxFirst - ntna - 2) >> 8) & 0xff; // length of data block hb
}

/*************************************************************************
*
* Build filter data package for AN-ZBANA
*
*************************************************************************/
void BuildANAFilter(char ch, short pointer) {

    char port;
    short ntna;
    UART[ch].RxSendReply = true;                               // flag for answering

    UART[ch].pTxBuffer[UART[ch].TxFirst++] = CMD_REP_ANA_FILTER & 0xff;
    UART[ch].pTxBuffer[UART[ch].TxFirst++] = CMD_REP_ANA_FILTER >> 8;
    ntna = UART[ch].TxFirst;                                    /* remember index */
    UART[ch].TxFirst += 2;                                      // two byte length

    for (port = 0; port < 12; port++) {
#if USE_MODBUS_PROTOCOL == 1
        UART[ch].pTxBuffer[UART[ch].TxFirst++] = (char)TData.Ana.Filter[port];
#else
        UART[ch].pTxBuffer[UART[ch].TxFirst++] = TData.Ana.Filter[port];
#endif
    }

    UART[ch].pTxBuffer[ntna] = (UART[ch].TxFirst - ntna - 2) & 0xff;      // length of data block lb
    UART[ch].pTxBuffer[ntna + 1] = ((UART[ch].TxFirst - ntna - 2) >> 8) & 0xff; // length of data block hb
}

/*************************************************************************
*
* Build datablock for External AD (ANA)
*
*************************************************************************/
void BuildMDataANA(char ch, short pointer) {

    short ntna, i;
    UART[ch].RxSendReply = true;                               // flag for answering

    UART[ch].pTxBuffer[UART[ch].TxFirst++] = CMD_REP_ANA_MDATA & 0xff;
    UART[ch].pTxBuffer[UART[ch].TxFirst++] = CMD_REP_ANA_MDATA >> 8;
    ntna = UART[ch].TxFirst;                                    /* remember index */
    UART[ch].TxFirst += 2;                                      // two byte length

    UART[ch].pTxBuffer[UART[ch].TxFirst++] = (RestartStatus << 4);    // Add restart status
    for (i = 0; i < 12; i++) {
        UART[ch].pTxBuffer[UART[ch].TxFirst++] = TData.Ana.Status[i];
        *((float *)&UART[ch].pTxBuffer[UART[ch].TxFirst]) = *((float *)&TData.Ana.Result[i]);   // ADresult
        UART[ch].TxFirst += sizeof(float);
    }

    UART[ch].pTxBuffer[ntna] = (UART[ch].TxFirst - ntna - 2) & 0xff;      // length of data block lb
    UART[ch].pTxBuffer[ntna + 1] = ((UART[ch].TxFirst - ntna - 2) >> 8) & 0xff; // length of data block hb

